app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def show
    companyData = Company.where(id: params[:id]).first
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_company
      @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]