app/controllers/items_controller.rb

INSERT INTO "items" ("name", "amount", "autoRestock", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "iron"], ["amount", 500], ["autoRestock", false], ["price", 50], ["created_at", "2021-08-29 03:32:43.385172"], ["updated_at", "2021-08-29 03:32:43.385172"]]
SELECT  "locations".* FROM "locations" WHERE "locations"."company_id" = $1 AND "locations"."id" = $2 ORDER BY "locations"."id" ASC LIMIT $3  [["company_id", 9], ["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "amount" = COALESCE("amount", 0) + 5 WHERE "items"."id" = $1  [["id", 15]]
---
  def create
    @item = Item.create(name:name, price:price, amount:amount)
    @item.location = current_company.location.where(id:locationId)
    respond_to do |format|
      if @item.save

SELECT  "locations".* FROM "locations" WHERE "locations"."company_id" = $1 AND "locations"."address" = $2 ORDER BY "locations"."id" ASC LIMIT $3  [["company_id", 9], ["address", "59 maccarthy street"], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."location_id" = $1 AND "items"."name" = $2 ORDER BY "items"."id" ASC LIMIT $3  [["location_id", 1], ["name", "alphatest"], ["LIMIT", 1]]
UPDATE "items" SET "amount" = COALESCE("amount", 0) + 1000 WHERE "items"."id" = $1  [["id", 258]]
UPDATE "items" SET "amount" = COALESCE("amount", 0) - 1000 WHERE "items"."id" = $1  [["id", 138]]
INSERT INTO "items" ("name", "amount", "lastSupplier", "autoRestock", "price", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def tradeItem
    toLocation = current_company.locations.where(address: [:recepLocation]).first
    location = current_company.locations.where(id: params[:locationId]).first
    if(location.is_supplier === true)
      updatedItem = location.stock.items.where(name: params[:name]).first
      toUpdatedItem = toLocation.stock.items.where(name: params[:name]).first
      if(toUpdatedItem.exists? && updatedItem.amount > params[:amount])
        updatedItem.increment!(:amount, -params[:amount])
        toUpdatedItem.increment!(:amount, params[:amount])
      elsif(updatedItem.amount > params[:amount])
        updatedItem.increment!(:amount, -params[:amount])
        item = Item.create(name: params[:name], amount:[:amount], restockPoint: 0)
        toLocation.stock << item

SELECT  "items".* FROM "items" WHERE "items"."stock_id" = $1 AND "items"."id" = $2 ORDER BY "items"."id" ASC LIMIT $3  [["stock_id", 7], ["id", 13], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."company_id" = $1 AND "locations"."id" = $2 ORDER BY "locations"."id" ASC LIMIT $3  [["company_id", 7], ["id", 7], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."location_id" = $1 LIMIT $2  [["location_id", 7], ["LIMIT", 1]]
UPDATE "items" SET "amount" = COALESCE("amount", 0) + 10 WHERE "items"."id" = $1  [["id", 13]]
UPDATE "items" SET "amount" = COALESCE("amount", 0) - 500 WHERE "items"."id" = $1  [["id", 13]]
UPDATE "items" SET "amount" = COALESCE("amount", 0) + 1300 WHERE "items"."id" = $1  [["id", 139]]
UPDATE "items" SET "amount" = COALESCE("amount", 0) - 3000 WHERE "items"."id" = $1  [["id", 139]]
---
  def changeItem
    locationItem = current_company.locations.where(id: params[:locationId]).first.stock.items.where(id: params[:id]).first
    if(params[:amount] > 0)
      locationItem.increment!(:amount, params[:amount])
    else
      locationItem.increment!(:amount, --params[:amount])
      if(locationItem.amount <= locationItem.restockPoint)
        previousSupplierItem = Location.where(id:locationItem.lastSupplier).first.stock.items.where(name:locationItem.name).first
        if(previousSupplierItem.amount > (locationItem.restockTo - locationItem.amount))
          previousSupplierItem.increment!(:amount, -(locationItem.restockTo - locationItem.amount))
          locationItem.stock.location.company.increment!(:cash, -previousSupplierItem.price * (locationItem.restockTo - locationItem.amount))
          locationItem.update(amount: locationItem.restockTo)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 14]]
SELECT  "items".* FROM "items" WHERE "items"."stock_id" = $1 AND "items"."id" = $2 ORDER BY "items"."id" ASC LIMIT $3  [["stock_id", 7], ["id", 13], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."company_id" = $1 AND "locations"."id" = $2 ORDER BY "locations"."id" ASC LIMIT $3  [["company_id", 7], ["id", 7], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."location_id" = $1 LIMIT $2  [["location_id", 7], ["LIMIT", 1]]
---
  def deleteItem
    current_company.locations.where(id: params[:locationId]).first.stock.items.where(id: params[:id]).first.destroy