app/controllers/items_controller.rb

  def create
    @item = Item.create(item_params)
    current_company.locations.where(id:params[:locationId]).first.items << @item
---
SELECT  "items".* FROM "items" WHERE "items"."location_id" = $1 LIMIT $2  [["location_id", 1], ["LIMIT", 11]]
SELECT  "locations".* FROM "locations" WHERE "locations"."company_id" = $1 AND "locations"."id" = $2 LIMIT $3  [["company_id", 9], ["id", 1], ["LIMIT", 11]]

  def giveItem
    toLocation = Company.where(name: params[:recepCompany]).first.locations.where(address: params[:recepLocation]).first
    location = current_company.locations.where(id: params[:locationId]).first
---
SELECT  "locations".* FROM "locations" WHERE "locations"."company_id" = $1 AND "locations"."address" IS NULL ORDER BY "locations"."id" ASC LIMIT $2  [["company_id", 7], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."name" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["name", "origin"], ["LIMIT", 1]]