app/controllers/items_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."name" = $1 ORDER BY "companies"."id" ASC LIMIT $2  [["name", "origin"], ["LIMIT", 1]]
---
  def tradeItem
    toLocation = Company.where(name: params[:recepCompany]).first.locations.where(address: [:recepLocationId])
    location = current_user.locations.where(address: params[:locationId]).first
    if(location.is_supplier === true)
      updatedItem = location.stock.items.where(name: params[:name]).first
      toUpdatedItem = toLocation.first.stock.items.where(name: params[:name]).first