app/controllers/locations_controller.rb

  def show
    locationData = current_company.locations.where(id: params[:id]).first
---
SELECT  "locations".* FROM "locations" WHERE "locations"."company_id" = $1 AND "locations"."id" = $2 ORDER BY "locations"."id" ASC LIMIT $3  [["company_id", 7], ["id", 7], ["LIMIT", 1]]

  def create
    @location = Location.create(location_params)
    @location.company = current_company
    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("address", "phone", "manager", "company_id", "created_at", "updated_at", "is_supplier") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @location.destroy
---
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 55]]

    def set_location
      @location = Location.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]